20250706181049-msc_computer_science.org
:PROPERTIES:
:ID:       52d1b420-629d-48f5-b812-163e61c428e5
:END:
#+title: MSc Computer Science

* [[id:ca753e50-3425-41d5-af55-4c43ceb98148][Foundational Mathematics]]
* [[id:2701e485-f68b-478e-b35d-d99f309b87aa][Discrete Mathematics (Pre)]]


Each credit is equivalent to *10* hours of study, meaning a *20*-credit course requires around *200* hours of study.

This includes assessment preparation.

We recommend allowing around *16-18* hours of study per week if you wish to complete a *20*-credit course within one semester.

** Course
*** [[id:fda22288-6fef-47da-bf44-87c86cfe5e68][Programming and Program Design F91PD]]
*** [[id:26229b51-5181-42c7-9224-bc9de36e8fb5][Mathematics for Computer Science F91MC]]
*** [[id:8bb1fa29-9931-4a42-ae75-f5f8ec41b426][Databases and Knowledge Representation F91DB]]
*** [[id:ad7f22f0-50fa-46df-9668-dc026fac7b00][Data Structures and Algorithms F91DS]]
*** [[id:9eec8bcf-cbae-4a3a-bcc3-deae43d6f84e][Artificial Intelligence F91AI]]
*** [[id:f8d2986b-0f45-4b53-834c-2711ad7a8ba3][Software Design and Engineering F91SD]]
*** [[id:1e46ad93-ee9c-445a-8d32-1a7031b7d627][Data Mining and Machine Learning F91DM]]
*** [[id:5ffbc9e9-0036-4df1-8f45-c10e0dfdf307][Industry Specialisation F91IS]]
*** [[id:325f176e-ea78-4fa0-a39d-5406f56bf1c3][Capstone Project F91CP]]
** Notes
[[id:4eeadf74-8cef-4276-85a3-5865e0892c7e][Peer Reviews]]
