20250706181049-msc_computer_science.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-03 Tue 07:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MSc Computer Science</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">MSc Computer Science</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org198900a">1. Foundational Mathematics</a></li>
<li><a href="#org4a405e2">2. Discrete Mathematics (Pre)</a>
<ul>
<li><a href="#orgbf09f26">2.1. Course</a>
<ul>
<li><a href="#org829a0ba">2.1.1. Programming and Program Design F91PD</a></li>
<li><a href="#orge46626e">2.1.2. Mathematics for Computer Science F91MC</a></li>
<li><a href="#org500d1cd">2.1.3. Databases and Knowledge Representation F91DB</a></li>
<li><a href="#orgb069adf">2.1.4. Data Structures and Algorithms F91DS</a></li>
<li><a href="#org17c3a6d">2.1.5. Artificial Intelligence F91AI</a></li>
<li><a href="#orgc54f4bc">2.1.6. Software Design and Engineering F91SD</a></li>
<li><a href="#org8368d83">2.1.7. Data Mining and Machine Learning F91DM</a></li>
<li><a href="#orgf539459">2.1.8. Industry Specialisation F91IS</a></li>
<li><a href="#org579948d">2.1.9. Capstone Project F91CP</a></li>
</ul>
</li>
<li><a href="#orgeb40ef2">2.2. Notes</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org198900a" class="outline-2">
<h2 id="org198900a"><span class="section-number-2">1.</span> <a href="20250708190653-foundational_mathematics.html#ID-ca753e50-3425-41d5-af55-4c43ceb98148">Foundational Mathematics</a></h2>
</div>
<div id="outline-container-org4a405e2" class="outline-2">
<h2 id="org4a405e2"><span class="section-number-2">2.</span> <a href="20250706181125-discrete_mathematics_pre.html#ID-2701e485-f68b-478e-b35d-d99f309b87aa">Discrete Mathematics (Pre)</a></h2>
<div class="outline-text-2" id="text-2">
<p>
Each credit is equivalent to <b>10</b> hours of study, meaning a <b>20</b>-credit course requires around <b>200</b> hours of study.
</p>

<p>
This includes assessment preparation.
</p>

<p>
We recommend allowing around <b>16-18</b> hours of study per week if you wish to complete a <b>20</b>-credit course within one semester.
</p>
</div>

<div id="outline-container-orgbf09f26" class="outline-3">
<h3 id="orgbf09f26"><span class="section-number-3">2.1.</span> Course</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org829a0ba" class="outline-4">
<h4 id="org829a0ba"><span class="section-number-4">2.1.1.</span> <a href="20260114205830-programming_and_program_design_f91pd.html#ID-fda22288-6fef-47da-bf44-87c86cfe5e68">Programming and Program Design F91PD</a></h4>
</div>
<div id="outline-container-orge46626e" class="outline-4">
<h4 id="orge46626e"><span class="section-number-4">2.1.2.</span> <a href="20260114205839-mathematics_for_computer_science_f91mc.html#ID-26229b51-5181-42c7-9224-bc9de36e8fb5">Mathematics for Computer Science F91MC</a></h4>
</div>
<div id="outline-container-org500d1cd" class="outline-4">
<h4 id="org500d1cd"><span class="section-number-4">2.1.3.</span> <a href="20260114205851-databases_and_knowledge_representation_f91db.html#ID-8bb1fa29-9931-4a42-ae75-f5f8ec41b426">Databases and Knowledge Representation F91DB</a></h4>
</div>
<div id="outline-container-orgb069adf" class="outline-4">
<h4 id="orgb069adf"><span class="section-number-4">2.1.4.</span> <a href="20260114205858-data_structures_and_algorithms_f91ds.html#ID-ad7f22f0-50fa-46df-9668-dc026fac7b00">Data Structures and Algorithms F91DS</a></h4>
</div>
<div id="outline-container-org17c3a6d" class="outline-4">
<h4 id="org17c3a6d"><span class="section-number-4">2.1.5.</span> <a href="20260114205917-artificial_intelligence_f91ai.html#ID-9eec8bcf-cbae-4a3a-bcc3-deae43d6f84e">Artificial Intelligence F91AI</a></h4>
</div>
<div id="outline-container-orgc54f4bc" class="outline-4">
<h4 id="orgc54f4bc"><span class="section-number-4">2.1.6.</span> <a href="20260114205925-software_design_and_engineering_f91sd.html#ID-f8d2986b-0f45-4b53-834c-2711ad7a8ba3">Software Design and Engineering F91SD</a></h4>
</div>
<div id="outline-container-org8368d83" class="outline-4">
<h4 id="org8368d83"><span class="section-number-4">2.1.7.</span> <a href="20260114205931-data_mining_and_machine_learning_f91dm.html#ID-1e46ad93-ee9c-445a-8d32-1a7031b7d627">Data Mining and Machine Learning F91DM</a></h4>
</div>
<div id="outline-container-orgf539459" class="outline-4">
<h4 id="orgf539459"><span class="section-number-4">2.1.8.</span> <a href="20260114205940-industry_specialisation_f91is.html#ID-5ffbc9e9-0036-4df1-8f45-c10e0dfdf307">Industry Specialisation F91IS</a></h4>
</div>
<div id="outline-container-org579948d" class="outline-4">
<h4 id="org579948d"><span class="section-number-4">2.1.9.</span> <a href="20260114205946-capstone_project_f91cp.html#ID-325f176e-ea78-4fa0-a39d-5406f56bf1c3">Capstone Project F91CP</a></h4>
</div>
</div>
<div id="outline-container-orgeb40ef2" class="outline-3">
<h3 id="orgeb40ef2"><span class="section-number-3">2.2.</span> Notes</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<a href="20260115075624-peer_reviews.html#ID-4eeadf74-8cef-4276-85a3-5865e0892c7e">Peer Reviews</a>
</p>
</div>
</div>
</div>
</div>
</body>
</html>
